GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
# ST NUCLEO-L073RZ
# ---------------------------------------
NUCLEO-L073RZ.name=NUCLEO-L073RZ
NUCLEO-L073RZ.vid.0=0x0483
NUCLEO-L073RZ.pid.0=0x374b

NUCLEO-L073RZ.upload.tool=stm32l0_openocd
NUCLEO-L073RZ.upload.protocol=stlink
NUCLEO-L073RZ.upload.maximum_size=196608
NUCLEO-L073RZ.upload.maximum_data_size=20480
NUCLEO-L073RZ.upload.use_1200bps_touch=true
NUCLEO-L073RZ.upload.wait_for_upload_port=false
NUCLEO-L073RZ.upload.native_usb=false

NUCLEO-L073RZ.build.mcu=cortex-m0plus
NUCLEO-L073RZ.build.f_cpu=32000000L
NUCLEO-L073RZ.build.board=STM32L0_NUCLEO
NUCLEO-L073RZ.build.arch=stm32l0
NUCLEO-L073RZ.build.core=arduino
NUCLEO-L073RZ.build.vid=0x0483
NUCLEO-L073RZ.build.pid=0x374b
NUCLEO-L073RZ.build.did=0xffff
NUCLEO-L073RZ.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
NUCLEO-L073RZ.build.ldscript=linker_scripts/STM32L073RZ_FLASH.ld
NUCLEO-L073RZ.build.openocdscript=openocd_scripts/nucleo-l073rz.cfg
NUCLEO-L073RZ.build.variant=NUCLEO-L073RZ
NUCLEO-L073RZ.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
NUCLEO-L073RZ.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

NUCLEO-L073RZ.menu.speed.32=32 MHz
NUCLEO-L073RZ.menu.speed.32.build.f_cpu=32000000L
NUCLEO-L073RZ.menu.speed.16=16 MHz
NUCLEO-L073RZ.menu.speed.16.build.f_cpu=16000000L
NUCLEO-L073RZ.menu.speed.4=4.2 MHz
NUCLEO-L073RZ.menu.speed.4.build.f_cpu=4200000L

NUCLEO-L073RZ.menu.opt.os=Smallest Code
NUCLEO-L073RZ.menu.opt.os.build.flags.optimize=-Os
NUCLEO-L073RZ.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
NUCLEO-L073RZ.menu.opt.o1=Fast
NUCLEO-L073RZ.menu.opt.o1.build.flags.optimize=-O1
NUCLEO-L073RZ.menu.opt.o1.build.flags.ldspecs=
NUCLEO-L073RZ.menu.opt.o2=Faster
NUCLEO-L073RZ.menu.opt.o2.build.flags.optimize=-O2
NUCLEO-L073RZ.menu.opt.o2.build.flags.ldspecs=
NUCLEO-L073RZ.menu.opt.o3=Fastest
NUCLEO-L073RZ.menu.opt.o3.build.flags.optimize=-O3
NUCLEO-L073RZ.menu.opt.o3.build.flags.ldspecs=


# UT2UH K33-L072Z
# ---------------------------------------
K33-L072Z.name=K33-L072Z
K33-L072Z.vid.0=0x0483
K33-L072Z.pid.0=0x374e

K33-L072Z.upload.tool=stm32l0_openocd
K33-L072Z.upload.protocol=stlink
K33-L072Z.upload.maximum_size=196608
K33-L072Z.upload.maximum_data_size=20480
K33-L072Z.upload.use_1200bps_touch=true
K33-L072Z.upload.wait_for_upload_port=false
K33-L072Z.upload.native_usb=false

K33-L072Z.build.mcu=cortex-m0plus
K33-L072Z.build.f_cpu=32000000L
K33-L072Z.build.board=K33
K33-L072Z.build.arch=stm32l0
K33-L072Z.build.core=arduino
K33-L072Z.build.vid=0x0483
K33-L072Z.build.pid=0x374e
K33-L072Z.build.did=0xffff
K33-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
K33-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
K33-L072Z.build.openocdscript=openocd_scripts/k33_test.cfg
K33-L072Z.build.variant=K33-L072Z
K33-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
K33-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K33-L072Z.menu.speed.32=32 MHz
K33-L072Z.menu.speed.32.build.f_cpu=32000000L
K33-L072Z.menu.speed.16=16 MHz (No USB)
K33-L072Z.menu.speed.16.build.f_cpu=16000000L
K33-L072Z.menu.speed.4=4.2 MHz (No USB)
K33-L072Z.menu.speed.4.build.f_cpu=4200000L

K33-L072Z.menu.opt.os=Smallest Code
K33-L072Z.menu.opt.os.build.flags.optimize=-Os
K33-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K33-L072Z.menu.opt.o1=Fast
K33-L072Z.menu.opt.o1.build.flags.optimize=-O1
K33-L072Z.menu.opt.o1.build.flags.ldspecs=
K33-L072Z.menu.opt.o2=Faster
K33-L072Z.menu.opt.o2.build.flags.optimize=-O2
K33-L072Z.menu.opt.o2.build.flags.ldspecs=
K33-L072Z.menu.opt.o3=Fastest
K33-L072Z.menu.opt.o3.build.flags.optimize=-O3
K33-L072Z.menu.opt.o3.build.flags.ldspecs=


# UT2UH K33-L082Z-STL
# ---------------------------------------
K33-L082Z-STL.name=K33-L082Z-STL
K33-L082Z-STL.vid.0=0x0483
K33-L082Z-STL.pid.0=0x374e

K33-L082Z-STL.upload.tool=stm32l0_openocd
K33-L082Z-STL.upload.protocol=stlink
K33-L082Z-STL.upload.maximum_size=196608
K33-L082Z-STL.upload.maximum_data_size=20480
K33-L082Z-STL.upload.use_1200bps_touch=true
K33-L082Z-STL.upload.wait_for_upload_port=false
K33-L082Z-STL.upload.native_usb=false

K33-L082Z-STL.build.mcu=cortex-m0plus
K33-L082Z-STL.build.f_cpu=32000000L
K33-L082Z-STL.build.board=K33_STLINK
K33-L082Z-STL.build.arch=stm32l0
K33-L082Z-STL.build.core=arduino
K33-L082Z-STL.build.vid=0x0483
K33-L082Z-STL.build.pid=0x374e
K33-L082Z-STL.build.did=0xffff
K33-L082Z-STL.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
K33-L082Z-STL.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
K33-L082Z-STL.build.openocdscript=openocd_scripts/k33.cfg
K33-L082Z-STL.build.variant=K33-L082Z-STL
K33-L082Z-STL.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
K33-L082Z-STL.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K33-L082Z-STL.menu.speed.32=32 MHz
K33-L082Z-STL.menu.speed.32.build.f_cpu=32000000L
K33-L082Z-STL.menu.speed.16=16 MHz (No USB)
K33-L082Z-STL.menu.speed.16.build.f_cpu=16000000L
K33-L082Z-STL.menu.speed.4=4.2 MHz (No USB)
K33-L082Z-STL.menu.speed.4.build.f_cpu=4200000L

K33-L082Z-STL.menu.opt.os=Smallest Code
K33-L082Z-STL.menu.opt.os.build.flags.optimize=-Os
K33-L082Z-STL.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K33-L082Z-STL.menu.opt.o1=Fast
K33-L082Z-STL.menu.opt.o1.build.flags.optimize=-O1
K33-L082Z-STL.menu.opt.o1.build.flags.ldspecs=
K33-L082Z-STL.menu.opt.o2=Faster
K33-L082Z-STL.menu.opt.o2.build.flags.optimize=-O2
K33-L082Z-STL.menu.opt.o2.build.flags.ldspecs=
K33-L082Z-STL.menu.opt.o3=Fastest
K33-L082Z-STL.menu.opt.o3.build.flags.optimize=-O3
K33-L082Z-STL.menu.opt.o3.build.flags.ldspecs=


