GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
K76-S76S.menu.speed.32=32 MHz
K76-S76S.menu.speed.32.build.f_cpu=32000000L

K76-S76S.menu.opt.os=Smallest Code
K76-S76S.menu.opt.os.build.flags.optimize=-Os
K76-S76S.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K76-S76S.menu.opt.o1=Fast
K76-S76S.menu.opt.o1.build.flags.optimize=-O1
K76-S76S.menu.opt.o1.build.flags.ldspecs=
K76-S76S.menu.opt.o2=Faster
K76-S76S.menu.opt.o2.build.flags.optimize=-O2
K76-S76S.menu.opt.o2.build.flags.ldspecs=
K76-S76S.menu.opt.o3=Fastest
K76-S76S.menu.opt.o3.build.flags.optimize=-O3
K76-S76S.menu.opt.o3.build.flags.ldspecs=


# UT2UH K92 L072Z
# ---------------------------------------
K92-L072Z.name=K92-L072Z
K92-L072Z.vid.0=0x0483
K92-L072Z.pid.0=0x374e

K92-L072Z.upload.tool=stm32l0_openocd
K92-L072Z.upload.protocol=stlink
K92-L072Z.upload.maximum_size=196608
K92-L072Z.upload.maximum_data_size=20480
K92-L072Z.upload.use_1200bps_touch=true
K92-L072Z.upload.wait_for_upload_port=false
K92-L072Z.upload.native_usb=false

K92-L072Z.build.mcu=cortex-m0plus
K92-L072Z.build.f_cpu=32000000L
K92-L072Z.build.board=K92_L072Z
K92-L072Z.build.arch=stm32l0
K92-L072Z.build.core=arduino
K92-L072Z.build.vid=0x0483
K92-L072Z.build.pid=0x374e
K92-L072Z.build.did=0xffff
K92-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
K92-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
K92-L072Z.build.openocdscript=openocd_scripts/lgt92_l072cz.cfg
K92-L072Z.build.variant=K92-L072Z
K92-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
K92-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

K92-L072Z.menu.speed.32=32 MHz
K92-L072Z.menu.speed.32.build.f_cpu=32000000L
K92-L072Z.menu.speed.16=16 MHz (No USB)
K92-L072Z.menu.speed.16.build.f_cpu=16000000L
K92-L072Z.menu.speed.4=4.2 MHz (No USB)
K92-L072Z.menu.speed.4.build.f_cpu=4200000L

K92-L072Z.menu.opt.os=Smallest Code
K92-L072Z.menu.opt.os.build.flags.optimize=-Os
K92-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
K92-L072Z.menu.opt.o1=Fast
K92-L072Z.menu.opt.o1.build.flags.optimize=-O1
K92-L072Z.menu.opt.o1.build.flags.ldspecs=
K92-L072Z.menu.opt.o2=Faster
K92-L072Z.menu.opt.o2.build.flags.optimize=-O2
K92-L072Z.menu.opt.o2.build.flags.ldspecs=
K92-L072Z.menu.opt.o3=Fastest
K92-L072Z.menu.opt.o3.build.flags.optimize=-O3
K92-L072Z.menu.opt.o3.build.flags.ldspecs=


# DRAGINO LGT92 L072Z
# ---------------------------------------
LGT92-L072Z.name=LGT92-L072Z
LGT92-L072Z.vid.0=0x0483
LGT92-L072Z.pid.0=0x374e

LGT92-L072Z.upload.tool=stm32l0_openocd
LGT92-L072Z.upload.protocol=stlink
LGT92-L072Z.upload.maximum_size=196608
LGT92-L072Z.upload.maximum_data_size=20480
LGT92-L072Z.upload.use_1200bps_touch=true
LGT92-L072Z.upload.wait_for_upload_port=false
LGT92-L072Z.upload.native_usb=false

LGT92-L072Z.build.mcu=cortex-m0plus
LGT92-L072Z.build.f_cpu=32000000L
LGT92-L072Z.build.board=LGT92
LGT92-L072Z.build.arch=stm32l0
LGT92-L072Z.build.core=arduino
LGT92-L072Z.build.vid=0x0483
LGT92-L072Z.build.pid=0x374e
LGT92-L072Z.build.did=0xffff
LGT92-L072Z.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
LGT92-L072Z.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
LGT92-L072Z.build.openocdscript=openocd_scripts/lgt92_l072cz.cfg
LGT92-L072Z.build.variant=LGT92-L072Z
LGT92-L072Z.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
LGT92-L072Z.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

LGT92-L072Z.menu.speed.32=32 MHz
LGT92-L072Z.menu.speed.32.build.f_cpu=32000000L
LGT92-L072Z.menu.speed.16=16 MHz (No USB)
LGT92-L072Z.menu.speed.16.build.f_cpu=16000000L
LGT92-L072Z.menu.speed.4=4.2 MHz (No USB)
LGT92-L072Z.menu.speed.4.build.f_cpu=4200000L

LGT92-L072Z.menu.opt.os=Smallest Code
LGT92-L072Z.menu.opt.os.build.flags.optimize=-Os
LGT92-L072Z.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
LGT92-L072Z.menu.opt.o1=Fast
LGT92-L072Z.menu.opt.o1.build.flags.optimize=-O1
LGT92-L072Z.menu.opt.o1.build.flags.ldspecs=
LGT92-L072Z.menu.opt.o2=Faster
LGT92-L072Z.menu.opt.o2.build.flags.optimize=-O2
LGT92-L072Z.menu.opt.o2.build.flags.ldspecs=
LGT92-L072Z.menu.opt.o3=Fastest
LGT92-L072Z.menu.opt.o3.build.flags.optimize=-O3
LGT92-L072Z.menu.opt.o3.build.flags.ldspecs=


# AI_Thinker/RuiXingHengFang/RisingHF RHF76-052
# ---------------------------------------
RHF76-052.name=RHF76-052
RHF76-052.vid.0=0x0483
RHF76-052.pid.0=0x374e

RHF76-052.upload.tool=stm32l0_openocd
RHF76-052.upload.protocol=stlink
RHF76-052.upload.maximum_size=65536
RHF76-052.upload.maximum_data_size=8192
RHF76-052.upload.use_1200bps_touch=true
RHF76-052.upload.wait_for_upload_port=false
RHF76-052.upload.native_usb=false

RHF76-052.build.mcu=cortex-m0plus
RHF76-052.build.f_cpu=32000000L
RHF76-052.build.board=RHF76_052
RHF76-052.build.arch=stm32l0
RHF76-052.build.core=arduino
RHF76-052.build.vid=0x0483
RHF76-052.build.pid=0x374e
RHF76-052.build.did=0xffff
RHF76-052.build.extra_flags=-DSTM32L052xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
RHF76-052.build.ldscript=linker_scripts/STM32L052C8_FLASH.ld
RHF76-052.build.openocdscript=openocd_scripts/rhf76-l051c8.cfg
RHF76-052.build.variant=RHF76-052
RHF76-052.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l052xx -larm_cortexM0l_math
RHF76-052.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include"

